[
  {
    "Id": "832061",
    "ThreadId": "354510",
    "Html": "\r\n<p>Dear proyect members:</p>\r\n<p>&nbsp;</p>\r\n<p>First of all, congratulation for your work. LobsterPot HTML5 PivotViewer<br>\r\nopens the PivotViever technology to the Web standards.<br>\r\n<br>\r\nNow, we are trying to use it with our own data, so we have generated a<br>\r\ncollection of items by using the tools provided in the MSDN (basically,<br>\r\nthe cxml file and the associated image folders &amp; files).<br>\r\nThat collection can be loaded in the Microsoft Silverlight Pivot Viewer version without\r\n<br>\r\nproblems.<br>\r\n<br>\r\nAfter that, we have loaded the same collection with LobsterPot HTML5 PivotViewer, but it\r\n<br>\r\ndoesn't work.<br>\r\nSo, we wonder if the version of Pivot Viewer that you provide is<br>\r\ncompatible with the collections generated by using the Microsoft solutions.<br>\r\n<br>\r\nIn case of incompatibility, we would like to know which tools / methods<br>\r\nyou used for creating the example that is available at your web<br>\r\npage, in order to create our own collection in the same way.<br>\r\n<br>\r\nThank you very much.</p>\r\n",
    "PostedDate": "2012-05-04T00:40:07.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "832686",
    "ThreadId": "354510",
    "Html": "<p>Hi jLredondo</p>\n<p>I agree, this is a fantastic project and also offer my thanks and help to Roger and LobsterPot.</p>\n<p>I assume your CXML file was generated using a tool designed for embedding the metadata in the collection.<br /> This may throw some light&nbsp;&nbsp;<a href=\"http://tonychampion.net/blog/index.php/2011/09/to-cxml-or-not-to-cxml/\">http://tonychampion.net/blog/index.php/2011/09/to-cxml-or-not-to-cxml/</a>&nbsp;</p>\n<p>I used the Microsoft Excel plugin to create a testing collection.<br />I had problems getting it to display until I put the files/folders into the correct locations, as per the sample.</p>\n<p>Hope this helps.</p>\n<p>Bill</p>",
    "PostedDate": "2012-05-06T07:43:04.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "834539",
    "ThreadId": "354510",
    "Html": "<p>Hi&nbsp;jlredondo and Bill - thanks for the kind words.</p>\r\n<p>I've been testing the control with collections created by the Excel plug-in and with my own collection generator, and both work ok.</p>\r\n<p>As Bill suggested it is sensitive to the correct file/folder location, but if you're viewing the collection on your local file system there is a second issue with Cross Origin Resource Sharing (CORS) on some Browsers (IE9 and Chrome). This can be resolved by either using Firefox which doesn't seem to care so much about CORS or hosting the files on a web server and browsing them that way.</p>\r\n<p>The best way to debug issues like this is to hit F12 in your browser of choice - they all come with developer tools these days and the console window will usually point you in the right direction.</p>",
    "PostedDate": "2012-05-10T05:38:37.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "845073",
    "ThreadId": "354510",
    "Html": "<p>Hi Bill and Roger:<br /><br />Thank you very much for your responses. After being sure that it is possible to load collections generated by the Excel plugin our problem was better delimited so finally we have found the solution:<br /><br />In our first attempt, we were trying to load a collection that has been created some time ago (various months, indeed). The problem was that this collection had been generated by using an old version of the Excel plugin. When trying with the most recent one, the generated cxml file &amp; folder structure are compatible with the HTML5 Pivot Viewer.<br /><br />Now, I'm very curious about what Roger has called \"my own collection generator\". Is this generator a valid alternative to the Excel plugin? Is it available somewhere? <br />We would be very interested on this option specially if that software is not dependent on Microsoft solutions, because the server we are using for generating the collections is a Linux- based one.<br /><br />Many thanks in advance:<br /><br />Jos&eacute; Luis.</p>",
    "PostedDate": "2012-06-05T09:47:29.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "845272",
    "ThreadId": "354510",
    "Html": "<p>Hi&nbsp;<span>Jos&eacute;, I'm glad you got it to work in the end.</span></p>\r\n<p>The limitations of the Excel Add-In make it difficult to create anything other than simple collections. I've built my own collection generation tool as I was after something that I could use to generate collections based on a SQL query, and was more flexible than the Excel Add-In and pauthor.</p>\r\n<p>At this point in time I hadn't planned on releasing it as there are parts of it that require tweaking from project to project - meaning it's not yet as generic as it would need to be.&nbsp;It's built with C#.Net and I'm not really sure how well it would work on Linux with Mono.&nbsp;</p>\r\n<p>If you'd like send me an email with the collection details and I can let you know if what I've put together would be suitable - roger.noble@lobsterpot.com.au</p>",
    "PostedDate": "2012-06-05T17:08:49.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "853500",
    "ThreadId": "354510",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong><em>bill</em>noble wrote:</strong><br /></blockquote>\r\n<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\">I used the Microsoft Excel plugin to create a testing collection.<br /> I had problems getting it to display until I put the files/folders into the correct locations, as per the sample.</blockquote>\r\n<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><br /></blockquote>\r\n<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>jlredondo wrote:</strong><br /></blockquote>\r\n<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\">\r\n<p>In our first attempt, we were trying to load a collection that has been created some time ago (various months, indeed). The problem was that this collection had been <span style=\"text-decoration: underline;\"><strong>generated by using an old version of the Excel plugin</strong></span>. <strong><span style=\"text-decoration: underline;\">When trying with the most recent one</span></strong>,  the generated cxml file &amp; folder structure are compatible with the HTML5 Pivot Viewer.</p>\r\n<p><em>_____________________________</em></p>\r\n<p><em>I have had both these issues, which I am still struggling to resolve. Also have a UX reccomendation. I generated a cxml file and collection using excel plugin:<br /></em></p>\r\n<p><em>a) putting files/folders in correct location.....I replicate the folder structure for the 'pass summit' sample and get a visualisation but left hand side slider controls don't work. Check box controls do.<br /></em></p>\r\n<p><em>b) possible problems caused by excel plugin version.....may be contributing to (a). I am using plugin ver 1.0.0.1. </em></p>\r\n<p><em>c) UX - when transitioning, the images 'grey out'. This may be disruptive to understanding of the data and relationships. Not as smooth for brain and eye. May be more helpful to have the images not grey out. <br /></em></p>\r\n<p><em>Overall Roger, a great fix for putting silverlight onto html and tablets. I welcome some help on (a) and (b) and comment on (c). May wish to speak to you further about your commercial ver for a commercial application.<br /></em></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>&nbsp;</p>",
    "PostedDate": "2012-06-25T18:06:18.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "853624",
    "ThreadId": "354510",
    "Html": "<p>Hi harkusam,</p>\r\n<p>For (a) and (b) the first course of action when trying to figure out these type of problems is to hit F12 and have a look to see if there are any errors listed in the console - otherwise if your able to send me a copy of the CXML file I can have a look and work out what's going on - roger.noble@lobsterpot.com.au. If your uncomfortable sending me your data then you could either obfuscate it in some way, or I'm happy to sign an NDA.</p>\r\n<p>Implementing the functionality seen in (c) was a design decision that I made to improve performance -&nbsp;especially&nbsp;with larger collections. Trying to render the animation of hundreds of individual images can quickly slow things down significantly. If the tiles are not primarily image based then the way to get around it is to create a custom ImageController like I have in this collection -&nbsp;<a href=\"http://pivot.lobsterpot.com.au/pass2012.htm\">http://pivot.lobsterpot.com.au/pass2012.htm</a>. This collection implements basic semantic zoom functionality while rendering most of the tile on the client, except for the speaker image in the middle.&nbsp;</p>\r\n<p>For me I felt it much more important that the collections load in a reasonable amount of time, and that the filter animations do not get in the way of the UX of trying to explore the data set - if anyone feels strongly against that, I'm happy to turn that functionality off.</p>",
    "PostedDate": "2012-06-26T00:55:31.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]